<h1>Dataframes - Quadro de dados</h1>

In [26]:
from pandas import DataFrame
import numpy as np

In [4]:
data = {
    "Estado": ["Sao paulo", "Parana", "Goias", "Rio de Janeiro", "Minas Gerais"],
    "Ano": [2001, 2003, 2005, 2008, 2020],
    "Populacao": [1.5, 1.7, 3.6, 2.4, 2.9]
}

In [6]:
frame = DataFrame(data)

In [8]:
frame

           Estado   Ano  Populacao
0       Sao paulo  2001        1.5
1          Parana  2003        1.7
2           Goias  2005        3.6
3  Rio de Janeiro  2008        2.4
4    Minas Gerais  2020        2.9

In [14]:
type(frame)

pandas.core.frame.DataFrame

In [24]:
frame['Estado'].sort_index()

0         Sao paulo
1            Parana
2             Goias
3    Rio de Janeiro
4      Minas Gerais
Name: Estado, dtype: object

In [44]:
newFrame = DataFrame(data, columns = ["Ano", "Estado", "Populacao", "Debito"])

In [45]:
newFrame

    Ano          Estado  Populacao Debito
0  2001       Sao paulo        1.5    NaN
1  2003          Parana        1.7    NaN
2  2005           Goias        3.6    NaN
3  2008  Rio de Janeiro        2.4    NaN
4  2020    Minas Gerais        2.9    NaN

In [46]:
# Adicionando valor automatico no campo debito de < 5. 
newFrame["Debito"] = np.arange(5.)

In [47]:
# retorno estatistico sobre o dataframe
newFrame.describe()

               Ano  Populacao    Debito
count     5.000000   5.000000  5.000000
mean   2007.400000   2.420000  2.000000
std       7.503333   0.864292  1.581139
min    2001.000000   1.500000  0.000000
25%    2003.000000   1.700000  1.000000
50%    2005.000000   2.400000  2.000000
75%    2008.000000   2.900000  3.000000
max    2020.000000   3.600000  4.000000

In [49]:
newFrame[1:3]

    Ano  Estado  Populacao  Debito
1  2003  Parana        1.7     1.0
2  2005   Goias        3.6     2.0

In [50]:
newFrame.loc[4]

Ano                  2020
Estado       Minas Gerais
Populacao             2.9
Debito                4.0
Name: 4, dtype: object

In [43]:
newFrame.iloc[2]

Ano           2005
Estado       Goias
Populacao      3.6
Debito         2.0
Name: 3st, dtype: object